Autodesk.Revit.DB.ExportPatternInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo.DestinationPatternName
The destination pattern name (the name of the pattern in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo.#ctor(System.String)
Constructs a new ExportPatternInfo using the destination pattern name as input.
destinationPatternName:
The destination pattern name (the name of the pattern in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo.#ctor
Constructs a new default ExportPatternInfo.
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo.#ctor(Autodesk.Revit.DB.ExportPatternInfo)
Constructs a new copy of the input ExportPatternInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo
A value used to represent the info stored in the Autodesk.Revit.DB.ExportPatternTable.
Since:
2014